In [1]:
import pandas as pd
data = pd.read_csv("emp-1.csv")
df = data

#cleaning dataset
#1 content access with pandas
#extract is,name and salary of first four rows
df1=df.loc[0:4,['id','name','salary']]
print("content access with pandas")
print(df1)

content access with pandas
   id     name  salary
0   1      Doe   75000
1   2    Smith   95000
2   3   Taylor   68000
3   4    Brown   82000
4   5  Johnson  120000

In [3]:
#3 display rows by horizontal slicing
df2 = df[3:6]
print("display rows by horizontal slicing")
print(df2)

display rows by horizontal slicing
   id First Name     name     dept  Position Date of Birth Date of Joining  \
3   4      Emily    Brown  Finance   Analyst    30-11-1988      05-11-2019
4   5    Michael  Johnson    Sales  Director    23-08-1983      17-01-2010

   salary              Email Address  Contact Number                  Address
3   82000      emily.brown@email.com      1122334455  321 Maple St, City, JKL
4  120000  michael.johnson@email.com      1223344556  654 Birch St, City, MNO

In [5]:
#2 print the column information
print("df.columns")
print(df.columns)

df.columns
Index(['id', 'First Name', 'name', 'dept', 'Position', 'Date of Birth',
       'Date of Joining', 'salary', 'Email Address', 'Contact Number',
       'Address'],
      dtype='object')

In [7]:
#verticle slicing
print("verticle slicing")
df3 = df[['id','salary']]
print(df3)

verticle slicing
   id  salary
0   1   75000
1   2   95000
2   3   68000
3   4   82000
4   5  120000

In [9]:
#4 Extract minimum or maximum from the info
print("Dropping first row from the information")
df4 = df.drop(labels=[0,2],axis=0)
print(df4)

Dropping first row from the information
   id First Name     name     dept   Position Date of Birth Date of Joining  \
1   2       Jane    Smith       IT  Developer    21-09-1985      14-07-2017
3   4      Emily    Brown  Finance    Analyst    30-11-1988      05-11-2019
4   5    Michael  Johnson    Sales   Director    23-08-1983      17-01-2010

   salary              Email Address  Contact Number                  Address
1   95000       jane.smith@email.com      1987654321    456 Oak St, City, DEF
3   82000      emily.brown@email.com      1122334455  321 Maple St, City, JKL
4  120000  michael.johnson@email.com      1223344556  654 Birch St, City, MNO

In [11]:
#5 a)dropping first row from the information
print("dropping first row from the information")
df4=df.drop(labels=[0,2],axis=0)
print(df4)

dropping first row from the information
   id First Name     name     dept   Position Date of Birth Date of Joining  \
1   2       Jane    Smith       IT  Developer    21-09-1985      14-07-2017
3   4      Emily    Brown  Finance    Analyst    30-11-1988      05-11-2019
4   5    Michael  Johnson    Sales   Director    23-08-1983      17-01-2010

   salary              Email Address  Contact Number                  Address
1   95000       jane.smith@email.com      1987654321    456 Oak St, City, DEF
3   82000      emily.brown@email.com      1122334455  321 Maple St, City, JKL
4  120000  michael.johnson@email.com      1223344556  654 Birch St, City, MNO

In [15]:
#5 b)delete specific columns
print("delete specific columns")
df5=df.drop(labels=['id','salary'],axis=1)
print(df5)

delete specific columns
  First Name     name       dept   Position Date of Birth Date of Joining  \
0       John      Doe         HR    Manager    15-05-1990      22-03-2015
1       Jane    Smith         IT  Developer    21-09-1985      14-07-2017
2       Mark   Taylor  Marketing  Executive    10-02-1992      18-06-2020
3      Emily    Brown    Finance    Analyst    30-11-1988      05-11-2019
4    Michael  Johnson      Sales   Director    23-08-1983      17-01-2010

               Email Address  Contact Number                  Address
0         john.doe@email.com      1234567890    123 Elm St, City, ABC
1       jane.smith@email.com      1987654321    456 Oak St, City, DEF
2      mark.taylor@email.com      1234123456   789 Pine St, City, GHI
3      emily.brown@email.com      1122334455  321 Maple St, City, JKL
4  michael.johnson@email.com      1223344556  654 Birch St, City, MNO

In [17]:
#6 deleting NaN values
print("Deleting NaN values")
df6 = df.dropna()
print(df6)

Deleting NaN values
   id First Name     name       dept   Position Date of Birth Date of Joining  \
0   1       John      Doe         HR    Manager    15-05-1990      22-03-2015
1   2       Jane    Smith         IT  Developer    21-09-1985      14-07-2017
2   3       Mark   Taylor  Marketing  Executive    10-02-1992      18-06-2020
3   4      Emily    Brown    Finance    Analyst    30-11-1988      05-11-2019
4   5    Michael  Johnson      Sales   Director    23-08-1983      17-01-2010

   salary              Email Address  Contact Number                  Address
0   75000         john.doe@email.com      1234567890    123 Elm St, City, ABC
1   95000       jane.smith@email.com      1987654321    456 Oak St, City, DEF
2   68000      mark.taylor@email.com      1234123456   789 Pine St, City, GHI
3   82000      emily.brown@email.com      1122334455  321 Maple St, City, JKL
4  120000  michael.johnson@email.com      1223344556  654 Birch St, City, MNO

In [19]:
#7row deletion
print("row deletion")
df7=df.dropna(axis=0,how='any')
print(df7)

row deletion
   id First Name     name       dept   Position Date of Birth Date of Joining  \
0   1       John      Doe         HR    Manager    15-05-1990      22-03-2015
1   2       Jane    Smith         IT  Developer    21-09-1985      14-07-2017
2   3       Mark   Taylor  Marketing  Executive    10-02-1992      18-06-2020
3   4      Emily    Brown    Finance    Analyst    30-11-1988      05-11-2019
4   5    Michael  Johnson      Sales   Director    23-08-1983      17-01-2010

   salary              Email Address  Contact Number                  Address
0   75000         john.doe@email.com      1234567890    123 Elm St, City, ABC
1   95000       jane.smith@email.com      1987654321    456 Oak St, City, DEF
2   68000      mark.taylor@email.com      1234123456   789 Pine St, City, GHI
3   82000      emily.brown@email.com      1122334455  321 Maple St, City, JKL
4  120000  michael.johnson@email.com      1223344556  654 Birch St, City, MNO

In [21]:
#8column deletion
print("column deletion")
df8=df.dropna(axis=1,how='all')
print(df8)

column deletion
   id First Name     name       dept   Position Date of Birth Date of Joining  \
0   1       John      Doe         HR    Manager    15-05-1990      22-03-2015
1   2       Jane    Smith         IT  Developer    21-09-1985      14-07-2017
2   3       Mark   Taylor  Marketing  Executive    10-02-1992      18-06-2020
3   4      Emily    Brown    Finance    Analyst    30-11-1988      05-11-2019
4   5    Michael  Johnson      Sales   Director    23-08-1983      17-01-2010

   salary              Email Address  Contact Number                  Address
0   75000         john.doe@email.com      1234567890    123 Elm St, City, ABC
1   95000       jane.smith@email.com      1987654321    456 Oak St, City, DEF
2   68000      mark.taylor@email.com      1234123456   789 Pine St, City, GHI
3   82000      emily.brown@email.com      1122334455  321 Maple St, City, JKL
4  120000  michael.johnson@email.com      1223344556  654 Birch St, City, MNO

In [23]:
#dataFrame manipulation using numpy
import numpy as np
arr1=np.array([[1,2,3],[4,5,6]])
print(arr1)
print(type(arr1))

[[1 2 3]
 [4 5 6]]
<class 'numpy.ndarray'>

In [25]:
df1 = pd.DataFrame(arr1,columns=['c1','c2','c3'])
print(df1)
print(type(df1))

   c1  c2  c3
0   1   2   3
1   4   5   6
<class 'pandas.core.frame.DataFrame'>